#!/usr/bin/perl -p

# 本程式是用來對 cman 繁體中文版作出的「善後處理」。
#
# 作者：霍東靈 Anthony Fok <foka@debian.org>
# 版權：GNU General Public License v2 或更新版本

# next if /^%/;

1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)“/$1「/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)”/$1」/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)裡/$1裏/);

# 簡 -> 繁
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)范例/$1範例/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(示|典|規))范/$1範/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)制(?=作|造)/$1製/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)復制/$1複製/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)盡管/$1儘管/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)游(?=戲|樂|玩)/$1遊/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(散|發))布/$1佈/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)于/$1於/);
# 1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(關|終|基|至|同|在|位))于/$1於/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)證/$1証/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)干淨/$1乾淨/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(?:日|標))志/$1誌/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)余/$1餘/);

1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)象/$1像/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(?:現|對|跡|抽|天|氣))像/$1象/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)像(?=徵|形|棋|牙)/$1象/);


    s/操作系統/作業系統/g;
    s/文本文件/純文字檔/g;
    s/文字處理/文書處理/g;
#    1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)文本/$1文字/);
    s/文本(?=模式|編輯|格式)/文字/g;
    s/文件管理器/檔案管理員/g;
    s/文件系統/檔案系統/g;
    s/服務器/伺服器/g;

s/即插即用/隨插即用/g;
s/窗口系統/視窗系統/g;
s/X~窗口/X~視窗/g;
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)窗口/$1視窗/);


# hashao 把 "server" 叫作 "服侍器" ……
s/服侍器/伺服器/g;

# Riser 把 "server" 叫作 "服務程序" ……
s/服務程序/伺服器/g;

1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)計算機/$1電腦/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)內核/$1核心/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)乙太(?=網)/$1以太/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)字體/$1字型/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)後台/$1背景/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)菜單/$1選單/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)屏幕/$1螢幕/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)光標/$1游標/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)鼠標/$1滑鼠/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)腳本/$1稿本/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)網絡/$1網路/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)互聯網/$1網際網路/);

#

1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)用戶/$1使用者/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)(缺省|默認)/$1預設/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)登錄/$1登入/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)文件名(?!稱|字)/$1檔名/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)文件/$1檔案/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)文檔/$1文件/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)兼容/$1相容/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)程序/$1程式/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)宏命令包(?!含|括)/$1巨集套件/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)宏命令/$1巨集/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)打印機/$1列表機/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)打印/$1列印/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)手工/$1手動/);
# 1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)支持/$1支援/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)後綴/$1延伸檔名/);
1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)內存/$1記憶體/);
s/配置文件/設定檔/g;
s/(警告|錯誤)信息/$1訊息/g;


    s/軟件包(?!裝|括)/套件/g;
    1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(軟|硬))件/$1體/);
    1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?(軟|硬|光|磁|Zip~))盤/$1碟/);
    1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)源(代)?碼/$1原始碼/);

# zh_HK --> zh_TW
#    1 while (s/^((?:[\x00-\x7f]|[\x80-\xff].)*?)磁碟/$1磁片/);


# s/\<t\<(.+?)\>\>/$1/g;

# s/\<s\<文檔\>\>/文件/g;
# s/\<s\<文件\>\>/檔案/g;
# s/\<s\<檔案\>\>/檔案庫/g;
# s/\<s\<文件名\>\>/檔案名稱/g;
# s/\<s\<配置文件\>\>/設定檔/g;
# s/\<s\<配置\>\>/設定/g;
# s/\<s\<程序\>\>/程式/g;
# s/客戶程序/客戶程式/g;
# s/\<s\<數據\>\>/資料/g;
# s/\<s\<信息\>\>/資訊/g;
# s/\<s\<默認\>\>/預設/g;
# s/\<s\<缺省\>\>/預設/g;
# s/\<s\<網關\>\>/閘道/g;
# s/\<s\<引導\>\>/啟動/g;
# s/\<s\<內存\>\>/記憶體/g;
# s/\<s\<支持\>\>/支援/g;
# s/\<s\<運行\>\>/執行/g;
# s/\<s\<包\>\>/套件/g;
# s/\<s\<注\>\>/註/g;
# s/\<s\<手工\>\>/手動/g;

    s/急救盤/急救磁碟/g;
    s/應急盤/急救磁碟/g;
    s/啟動盤/啟動磁碟/g;
    s/引導盤/啟動磁碟/g;

# And, finally, add an extra backslash where needed.
#s/\G((?:[\x00-\x7f]|[\x80-\xff].)*?[\x80-\xff]\\)/$1\\/g;

# 結束

sub changewww () {
    s|^(<HTML lang="zh)">|$1-TW">|;
    s/(\.zh)(?=\.(?:gif|jpg|png))/$1-tw/g;
    s|^<A href=".*">(中文&nbsp;\(Big5\))</A>(?=&nbsp;)|$1|;

    s/窗口系統/視窗系統/g;
    s/郵(遞|件)列表/通信論壇/g;
    s/鏡像((網)?站)/映射$1/g;
    s/網絡對象模型環境/網絡物件模型環境/g;
}
